src/Catalogs/ДоговорыВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ДоговорыВзаиморасчетов</Name>
			<Comment>Договоры взаиморасчетов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоЗакрытиеСделок</Name>
					<Comment>Значение по умолчанию для аналогичного флага в документах, влияющего на взаиморасчеты</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>Валюта взаиморасчетов по договору. Значение не может быть изменено, если по договору проведен хотя бы один документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>Вид договора с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Comment>Дата окончания учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала учета по договору</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГосударственногоКонтракта</Name>
					<Comment>Идентификатор государственного контракта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияОтчетНаОснованииПродаж</Name>
					<Comment>Способ расчета комиссии в отчете комитенту</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальныйКредит</Name>
					<Comment>Максимальная сумма кредита (долга) по договору в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Comment>Номер договора с контрагентом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПроект</Name>
					<Comment>Основной проект договора взаиморасчетов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтменаКонтроляСуммыКредита</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписанты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписантОтОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписанты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Comment>Процент комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентПредоплаты</Name>
					<Comment>Процент предоплаты по договору</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыЗадолженности</Name>
					<Comment>Срок оплаты задолженности (в днях)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Comment>Статья ДДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКомиссионногоВознаграждения</Name>
					<Comment>Сумма комиссионного вознаграждения для договоров комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Comment>Тип договора</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСкидкиНаценки</Name>
					<Comment>Тип скидки (наценки) по умолчанию для оформлению продаж по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСуммыКомиссии</Name>
					<Comment>Тип суммы комиссии: 0 - процентом,1 - фиксированной суммой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, используемый по умолчанию, при оформлении документов по договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиВзаиморасчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтсрочкаПлатежаЗависитОтСрокаГодности</Name>
					<Comment>Отсрочка платежа зависит от срока годности поставленных товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВБанковскихДнях</Name>
					<Comment>Считать все отстрочки в банковских днях (истина), в календарных (ложь)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентБонусногоВознаграждения</Name>
					<Comment>Процент бонусного вознаграждения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодВыплатыБонусныхВознаграждений</Name>
					<Comment>Период выплаты бонусных вознаграждений</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПериодичностьАнализаНакопительныхСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорНачисленияБонусов</Name>
					<Comment>Договор, на который будет происходить начисление суммы бонусов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакАгента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиАгента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапретаОтгрузкиПоДоговору</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьКурсСделки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗакрытияСделок</Name>
					<Comment>Способ закрытия сделок</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СпособЗакрытияСделок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьСогласованныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьНаличиеЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьРедактироватьЗакупочныеЦены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПродажуНижеСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСогласованнойЦены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПМастерКлюч</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРППризнакНовый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Бонусы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СхемаРасчетаБонусов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипБонуса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыБонусов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура, которая попадает в Акт об оказании услуг</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыОперацийДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыОперацийДоговора</Name>
			<Comment>Виды операций договора</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Операция покупки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Операция продажи</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
					<Comment>Внутренняя операция</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ДоговорыВзаиморасчетов/Ext/ManagerModule.bsl
// Модуль менеджера справочника "Договоры взаиморасчетов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Заполнение реквизита "Контроль максимальной суммы кредита" для уже введенных договоров с нулевой суммой кредита.
//
Процедура УстановкаКонтроляМаксимальнойСуммыКредита() Экспорт
	
	// Выполним проверку повторной установки данного релиза
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ОтменаКонтроляСуммыКредита = ИСТИНА";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() > 0 Тогда
		// Установка реквизита "Отмена контроля суммы кредита" у договора ранее уже производилась,
		// повторное заполнение не требуется.
		Возврат;
	КонецЕсли;
	
	// У всех договоров с суммой кредита 0.00 взводим флаг не контролировать кредит
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.МаксимальныйКредит = 0";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоговорСсылка = Выборка.Ссылка;
		ДоговорОбъект = ДоговорСсылка.ПолучитьОбъект();
		ДоговорОбъект.ОтменаКонтроляСуммыКредита = Истина;
		Если ДоговорОбъект.Модифицированность() Тогда
			ДоговорОбъект.ОбменДанными.Загрузка=Истина;
			ДоговорОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // УстановкаКонтроляМаксимальнойСуммыКредита()

// Заполнение реквизита "ЗаполнитьФлагАвтоЗакрытиеСделок" для уже введенных документов.
//
Процедура ЗаполнитьФлагАвтоЗакрытиеСделок() Экспорт
	
	СписокДокументов = Новый СписокЗначений;   
	СписокДокументов.Добавить("АвансовыйОтчет","АвансовыйОтчет");
	СписокДокументов.Добавить("ВводОстатковВзаиморасчетовСостав","ВводОстатковВзаиморасчетов.Состав");
	СписокДокументов.Добавить("ВозвратОтПокупателя","ВозвратОтПокупателя");
	СписокДокументов.Добавить("ВозвратПоставщику","ВозвратПоставщику");
	СписокДокументов.Добавить("Инвентаризация","Инвентаризация");
	СписокДокументов.Добавить("НачислениеЗарплатыСотрудники","НачислениеЗарплаты.Сотрудники");
	СписокДокументов.Добавить("ОбслуживаниеАктива","ОбслуживаниеАктива");
	СписокДокументов.Добавить("ОтчетКомиссионераТовары","ОтчетКомиссионера.Товары");
	СписокДокументов.Добавить("ОтчетКомитентуТовары","ОтчетКомитенту.Товары");
	СписокДокументов.Добавить("ПоступлениеТоваров","ПоступлениеТоваров");
	СписокДокументов.Добавить("ПоступлениеДопРасходов","ПоступлениеДопРасходов");
	СписокДокументов.Добавить("РеализацияАктивов","РеализацияАктивов");
	СписокДокументов.Добавить("РеализацияТоваров","РеализацияТоваров");
	СписокДокументов.Добавить("ТаможеннаяДекларацияИмпорт","ТаможеннаяДекларацияИмпорт");
	СписокДокументов.Добавить("ЧекОплаты","Чек.Оплаты");
	СписокДокументов.Добавить("ЧекНаОплатуОплаты","ЧекНаОплату.Оплаты");

	Запрос = Новый Запрос;
	ТекстЗапроса = "";
	
	ШаблонЗапроса = "ВЫБРАТЬ
	|	$НомерСтроки$ КАК НомерСтроки,
	|	$СтрокаЗначение$.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.$СтрокаПредставление$ КАК $СтрокаЗначение$
	|ГДЕ
	|	$СтрокаЗначение$.$ПутьКДоговору$ДоговорВзаиморасчетов.АвтоЗакрытиеСделок = ИСТИНА";
	
	ТекстИтоги = "
	|ИТОГИ ПО
	|	Ссылка";
		
	УсловиеСтроки = "
	|	$СтрокаЗначение$.НомерСтроки";
	
	Для Каждого Строка Из СписокДокументов Цикл
		
		Если НЕ ТекстЗапроса = "" Тогда
			ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|";
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ШаблонЗапроса;
		
		Если Строка.Значение = "ОтчетКомиссионераТовары" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$ПутьКДоговору$", "ДокументПередачи.");
		ИначеЕсли Строка.Значение = "ОтчетКомитентуТовары" Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаЗначение$.$ПутьКДоговору$ДоговорВзаиморасчетов.АвтоЗакрытиеСделок", " 
			|	ВЫБОР
	        |		КОГДА ОтчетКомитентуТовары.Ссылка.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ОтчетАгента)
	        |			ТОГДА ОтчетКомитентуТовары.ДокументРеализации.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок
	        |		ИНАЧЕ ОтчетКомитентуТовары.ДокументПоступления.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок
	        |	КОНЕЦ");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$ПутьКДоговору$", "");
		КонецЕсли;
		
		Если СтрНайти(Строка.Представление,".") = 0 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$НомерСтроки$", 0);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$НомерСтроки$", УсловиеСтроки);
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаПредставление$", Строка.Представление);
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "$СтрокаЗначение$", Строка.Значение);
		
	КонецЦикла;	
	
	Запрос.Текст = ТекстЗапроса + ТекстИтоги;
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ДокументСсылка = Выборка.Ссылка;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Представление = СтрЗаменить(ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументСсылка),"Документ.","");
		Если НЕ СписокДокументов.НайтиПоЗначению(Представление) = Неопределено Тогда
			ДокументОбъект.АвтоЗакрытиеСделок = Истина;
		Иначе
			Для Каждого Строка Из СписокДокументов Цикл
				Если СтрНайти(Строка.Представление,Представление) = 0 Тогда
					Продолжить;
				Иначе
					ДетальнаяВыборка = Выборка.Выбрать();
					Пока ДетальнаяВыборка.Следующий() Цикл
						ТабличнаяЧасть = СтрЗаменить(Строка.Представление,Представление + ".","");
						ДокументОбъект[ТабличнаяЧасть][ДетальнаяВыборка.НомерСтроки-1].АвтоЗакрытиеСделок = Истина;
					КонецЦикла;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;	
		ДокументОбъект.ОбменДанными.Загрузка=Истина;
		ДокументОбъект.Записать();
	КонецЦикла;
	
	// Приватно обработаем выплату. Так как тут в проведении раньше всегда была Истина.
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	ВыплатаЗарплатыСотрудники.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВыплатаЗарплаты.Сотрудники КАК ВыплатаЗарплатыСотрудники";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ДокументСсылка = Выборка.Ссылка;
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		Для Каждого Строка Из ДокументОбъект.Сотрудники Цикл
			Строка.АвтоЗакрытиеСделок = Истина;
		КонецЦикла;
		ДокументОбъект.ОбменДанными.Загрузка=Истина;
		ДокументОбъект.Записать();
	КонецЦикла;	
	
КонецПроцедуры // ЗаполнитьФлагАвтоЗакрытиеСделок()

// Заполнение тип договора у введенных договоров
//
Процедура УстановитьТипДоговора() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ПустаяСсылка)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ДоговорВзаиморасчетов = Выборка.Ссылка.ПолучитьОбъект();
		ДоговорВзаиморасчетов.ТипДоговора = Перечисления.ТипыДоговоров.Договор;
		
		ДоговорВзаиморасчетов.ОбменДанными.Загрузка = Истина;
		Попытка
			ДоговорВзаиморасчетов.Записать();
			ВывестиСообщение(НСтр("ru='Обновлен справочник ""%1"".'"),,,,, СокрЛП(ДоговорВзаиморасчетов.Наименование));
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи элемента справочника ""Договоры взаиморасчетов""'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры // УстановитьВидДеятельностиДоговора()

// Производит получение вида операции
Функция ПолучитьВидОперации(ВидДоговора) Экспорт
	
	Результат = Неопределено;
	Если ВидДоговора = Перечисления.ВидыДоговоров.Покупка ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СКомитентом Тогда
		Результат = Перечисления.ВидыОперацийДоговора.Покупка;
	ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоров.Продажа ИЛИ ВидДоговора = Перечисления.ВидыДоговоров.СКомиссионером Тогда
		Результат = Перечисления.ВидыОперацийДоговора.Продажа;
	Иначе
		Результат = Перечисления.ВидыОперацийДоговора.Внутренняя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ПолучитьВидОперации()

// Производит получение вида операции
Функция ПроверитьОсновнойДоговор(Договор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДоговорыВзаиморасчетов.Ссылка
	               |ИЗ
	               |	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
	               |ГДЕ
	               |	ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора
	               |	И ДоговорыВзаиморасчетов.Основной = ИСТИНА
	               |	И ДоговорыВзаиморасчетов.Организация = &Организация
	               |	И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &ПодразделениеКомпании
	               |	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ
	               |	И ДоговорыВзаиморасчетов.Ссылка <> &Ссылка
	               |	И ДоговорыВзаиморасчетов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Организация",Договор.Организация);
	Запрос.УстановитьПараметр("ПодразделениеКомпании",Договор.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ВидДоговора",Договор.ВидДоговора);
	Запрос.УстановитьПараметр("Владелец",Договор.Владелец);
	Запрос.УстановитьПараметр("Ссылка",Договор.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
	КонецЕсли;
	
	
КонецФункции //ПроверитьОсновнойДоговор()


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ВидДоговора");
	ОбязательныеРеквизиты.Добавить("ВалютаВзаиморасчетов");
	ОбязательныеРеквизиты.Добавить("ТипДоговора");
	
	Если НЕ Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор Тогда
		ОбязательныеРеквизиты.Добавить("ДатаНачала");
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.ПризнакАгента) Тогда
		ОбязательныеРеквизиты.Добавить("ИННПоставщика");	
	КонецЕсли;	
	
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Возвращает реквизиты объекта, которые не рекомендуется редактировать
// с помощью обработки группового изменения реквизитов.
//
// Возвращаемое значение:
//  Массив - список имен реквизитов объекта.
Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидДоговора");
	Результат.Добавить("Организация");
	Результат.Добавить("ПодразделениеКомпании");
	Результат.Добавить("ВалютаВзаиморасчетов");
	Возврат Результат;
	
КонецФункции


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Подразделение".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		Объект.ВалютаВзаиморасчетов = Объект.ПодразделениеКомпании.ОсновнаяВалютаВзаиморасчетов;
	КонецЕсли;
	
	Объект.АвтоЗакрытиеСделок = Объект.Организация.АвтоЗакрытиеСделок;
	
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Вызываем общий обработчик события
	ОбработкаСобытийСправочникаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
	Объект.АвтоЗакрытиеСделок = Объект.Организация.АвтоЗакрытиеСделок;
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Формирует стандартное наименование договора
// вида Договор поставки №ХХХХХ а Валюте от ДД.ММ.ГГГГ
// Используется как при интерактивном, так и при программном создании.
//
// Параметры:
//  Объект   - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Наименование = "";
	
	Если ЗначениеЗаполнено(Объект.ТипДоговора)
			И ЗначениеЗаполнено(Объект.ВидДоговора)
			И ЗначениеЗаполнено(Объект.ВалютаВзаиморасчетов) Тогда
		
		Если (Объект.ТипДоговора = Перечисления.ТипыДоговоров.ВиртуальныйДоговор) Тогда
			
			Наименование = СокрЛП(Строка(Объект.ВидДоговора)) + " в " + Объект.ВалютаВзаиморасчетов.Наименование;
			
		Иначе
			
			Наименование = СокрЛП(Строка(Объект.ВидДоговора))
								+ ?(ПустаяСтрока(Объект.НомерДоговора),""," № " + СокрЛП(Объект.НомерДоговора))
								+ " в " + Объект.ВалютаВзаиморасчетов.Наименование
								+ " от "+Формат(Объект.ДатаНачала,"ДФ=дд.ММ.гг");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()

// Обработчик события возникающего при изменении данных реквизита "Тип суммы комиссии".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Процедура ТипСуммыКомиссииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если Объект.ТипСуммыКомиссии = 0 Тогда
		Объект.ПроцентКомиссионногоВознаграждения = ?(Объект.СуммаКомиссионногоВознаграждения > 0,Объект.СуммаКомиссионногоВознаграждения ,0 );
		Объект.СуммаКомиссионногоВознаграждения = 0;
	ИначеЕсли Объект.ТипСуммыКомиссии = 1 Тогда
		Объект.СуммаКомиссионногоВознаграждения = ?(Объект.ПроцентКомиссионногоВознаграждения > 0,Объект.ПроцентКомиссионногоВознаграждения ,0 );
		Объект.ПроцентКомиссионногоВознаграждения = 0;
	КонецЕсли
	
КонецПроцедуры // ТипСуммыКомиссииПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли
